chore: mermeid diagram
